{
    "jobDescription": [
        {
            "company": "K-QuestJunctionLLP",
            "jobTitle": "VicePresidentdeliveryOperations",
            "jobLink": "foundit.in",
            "jobLocation": "Pune,India",
            "resumeGenerated": true,
            "jobDesc": "This role is responsible for leading an account with high complexity involving managed services, large program delivery, represent us and deal with CXO/SVP of the client organization. Also accountable for delivery excellence, customer delight, and employee satisfaction within the account and responsible for grooming competency in line with customer roadmap. Responsibilities and Duties : Responsible for planning and delivery - quality compliance, resource economic utilization and customer satisfaction. Responsible for relationship building with customer project managers and key stakeholders within the account and responsible for customer satisfaction. Responsible for people processes in the account, employee attrition rate, people and competency development and engagement. Collaborate and interact with client engagement managers, program/project managers from various internal teams and Client side. Ownership of Managed Services Operations, SLAs/KPIs, Collaboration within Applications & Infrastructure teams, People management. Work with Project and Technology team to plan releases to augment customer experience and optimizing processes. Identify process gaps and help plug them by simplification of the process- Producing accurate and timely reporting of program status throughout its life cycle. Business Direction and Strategy: Strategic Thinking, Business Acumen and Commercial Thinking, Effective Decision Making, Entrepreneurial Mindset, Systems Thinking and Negotiation and Influence Desired Candidate Profile Fundamental project management skills Project management tools & techniques such as Wrike, Atlassian Jira, MS Project etc. Excellent client-facing and internal communication skills Worked in an agile environment Working knowledge of SDLC and Architecture Understanding of the latest and upcoming technology developments 10+ years of experience Enterprise Portfolio Management Leading and managing teams in multiple technologies In-depth understanding and experience of the SDLC Previous in-depth experience with upselling and key account management B. Tech / MCA is the minimum eligibility criteria Preferred Leading and managing teams across multiple locations PMP / Lean Sigma / Prince II Certification"
        },
        {
            "company": "HSBC",
            "jobTitle": "TechnicalProjectDelivery-Head",
            "jobLink": "foundit.in",
            "jobLocation": "Pune,India",
            "resumeGenerated": true,
            "jobDesc": "We are currently seeking an experienced professional to join our team in the role of a Delivery Head In this role, you will: Drives delivery and supports the Product Owner (PO) in day-to-day planning and in assuring timely and planned delivery of product. Also, own the product roadmap alongside PO. Facilitate planning sessions and complies with the HSBC Agile Framework e.g. Scrum, Kanban, LEAN, SAFe. Ensures Business value is delivered across technical deliveries which are prioritised as per roadmapalongside business deliveries. In addition, ensure technical debt is not accumulated comprised when delivering new business capabilities. Responsible for managing risks and issues with PO/DL to unblock and mitigate risks. Regularly participates and drives innovation at asset class level and at organisational initiatives. ProvideTimely and accurate project updates as agreed with the project steering committee. Represent project team and accurate provide accurate project updates in all relevant forums. Answer project related questions at a reasonable level of technical and functional depth. Highlight Risks and facilitate their mitigation. Maintain, update and track RAID log. Collaborates and promotes team culture by being : Inclusive of others Sharings and listening. Supporting efforts of others. Motivating others to adopt change and do the right thing. 18years of experience and above required Requirements To be successful in this role, you should meet the following requirements: Agile/Scrum Development Experience Project Management/Stakeholder Management/Project Planning Java, Micro Services, Spring Boot DevOps, CICD Agile Tools (Jira, Confluence), Disciplined approach to requirements analysis with a software engineering or computer science background (either at degree level or working for a software company) Highly proficient in working in an agile way with a high empathy for continuous delivery and incremental business outcome driven - must be able to orchestrate smaller business driven outcomes for improving cadence. Communication Skills - A good listener, very effective communicator. Always strives to continue to learn and persuade others to continue to learn as well Ensures Business value is delivered across technical deliveries which are prioritised as per roadmap Documentation: Shall be able to articulate subject in a crisp and effective documentation Collaboration: Shall be well equipped with collaboration tools Problem solver Structured worker able to efficiently manage multiple tasks. You'll achieve more when you join HSBC. www.hsbc.com/careers HSBC is committed to building a culture where all employees are valued, respected and opinions count. We take pride in providing a workplace that fosters continuous professional development, flexible working and opportunities to grow within an inclusive and diverse environment. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement, which is available on our website."
        },
        {
            "company": "bp",
            "jobTitle": "Principal delivery manager ",
            "jobLink": "sdfsdfsf",
            "jobLocation": "REMOTE",
            "resumeGenerated": true,
            "jobDesc": "We are seeking a visionary and experienced senior leader to lead all aspects of the end-to-end management of our Modern Device Management (MDM) portfolio. This role is pivotal in driving operational excellence, technological innovation, and seamless end-user experience across our enterprise device ecosystem. Key Responsibilities: Device Lifecycle Management: Strategize, oversee, and lead the complete lifecycle of corporate hardware assets, including laptops, desktops, mobile devices, meeting room equipment, and peripheral devices. Lead the procurement process, ensuring alignment with business needs, budgetary constraints, and vendor capabilities. Ensure smooth distribution, maintenance, and timely decommissioning of all hardware devices. Virtual Desktop Infrastructure (VDI): Manage the organization’s VDI estate, ensuring secure, scalable, and efficient virtual environments. Operational Excellence: Develop and maintain standard methodologies for device management, including policies for provisioning, patch management, security compliance, and troubleshooting. Lead the adoption of modern management tools, processes, and technologies to enhance automation and reduce downtime. Vendor and Stakeholder Management: Cultivate strong relationships with key technology partners and hardware providers. Collaborate cross-functionally with IT, security, and business teams to ensure devices meet organizational requirements. Team Leadership and Development: Lead a team of skilled professionals, fostering a culture of innovation, collaboration, and accountability. Build capability within the team to stay ahead of emerging technologies and industry trends. Strategic Initiatives: Evaluate and implement innovative solutions to optimize the corporate device ecosystem, including sustainability initiatives for hardware management. Drive alignment between device strategy and organizational goals. Key characteristics of senior leaders at bp Intellectually curious: comfortable navigating between the big ideas and executional realities to build an achievable strategic product vision. Comfortable with ambiguity, a hunger to learn and a seeker of new challenges. Communicator & Influencer: comfortable influencing a group of executives as well as communicating your service vision clearly to your associates and partners. You can be open to different communication styles and listen carefully to diverse sets of ideas. Do-er: you're biased toward action and are willing to make commitments and trade-offs with other leaders to remove impediments for your team; you are a leader obsessed with delivering valuable in an iterative way. Customer focus: you care about growing others and bringing them together around what's possible. You have a desire and ability to connect with our employees to fully understand their needs and build long lasting relationships. Learner: you have an appetite to learn new things or new technologies all while exhibiting humbleness when exploring unknown technologies. Team player: you enjoy working with a diverse set of people and driving the team toward a common goal. You are also able to coach others and be a mentor in technology. You are an expert in guiding teams towards outcomes. Provides people leadership, team leadership, and models cross-discipline/org influence. Key qualifications: Proven track record in device lifecycle management and end-user computing in a large enterprise environment, working with leading hardware providers (e.g., Dell). Solid experience running VDI estates Deep understanding of modern device management frameworks and tools (e.g., Intune, SCCM, Jamf). Excellent leadership skills, with a focus on team development and customer engagement. Strategic problem solver with the ability to lead large-scale projects and drive groundbreaking initiatives. Preferred Qualifications: Experience with sustainability practices in device management. Familiarity with enterprise IT security standards related to device management. Certifications in ITIL, PMP, or equivalent. This role offers the opportunity to drive impactful change in how devices are managed across a global organization, ensuring our workforce is equipped with the right tools to excel in their roles. Travel Requirement Up to 10% travel should be expected with this role"
        }
    ]
}