{
    "jobDescription": [
        {
            "company": "VARAISYS PVT. LTD.",
            "jobTitle": "Technical Program Manager – Data Analytics",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4175029997/",
            "jobLocation": "Pune, Maharashtra, India (On-site)",
            "resumeGenerated": true,
            "jobDesc": "About the job Job role: Technical Program Manager – Data Analytics Location: Noida/Pune (WFO) Experience 12+ Years Job Description We are seeking an experienced and dynamic Technical Program Manager specializing in Data Analytics to join our team. In this role, you will oversee the end-to-end lifecycle of complex data-driven technical projects, from ideation to delivery, ensuring projects are completed on time, within scope, and within budget. You will collaborate with cross-functional teams, manage risks, and optimize resources to drive high-impact results in data analytics initiatives. Responsibilities Project Management: Lead and manage the full lifecycle of technical data analytics projects, ensuring adherence to project scope, quality, timelines, and budget constraints. Cross-functional Coordination: Work closely with engineering, data science, product management, business intelligence, and quality assurance teams to deliver seamless execution of data analytics programs. Risk Management: Proactively identify, assess, and mitigate risks related to data integrity, project timelines, and technical challenges to ensure project success. Data Strategy Alignment: Ensure alignment of technical initiatives with business goals and data strategies, translating business needs into actionable technical solutions. Resource Allocation: Manage resources, including personnel, technology, and budget, effectively to maximize efficiency and project outcomes. Performance Monitoring: Utilize project management and data tracking tools to monitor progress, provide reports on key metrics, and ensure programs meet predefined objectives and timelines. Stakeholder Communication: Provide regular, transparent communication to stakeholders regarding project status, risks, and potential delays, ensuring alignment with overall business objectives. Continuous Improvement: Identify areas for process improvement and drive initiatives to enhance the overall efficiency, quality, and delivery of data analytics programs. Skills And Qualifications Experience: 10+ years of experience in managing technical programs, with a strong background in data analytics, data engineering, or related fields. Technical Expertise: In-depth understanding of data analytics methodologies, tools, and technologies (e.g., Hadoop, Spark, SQL, Python), as well as software development methodologies (e.g., Agile, Scrum). Leadership: Proven ability to lead cross-functional teams, inspire collaboration, and motivate teams to achieve project goals in a fast-paced environment. Analytical Skills: Strong analytical and problem-solving abilities, with a focus on data-driven decision-making and delivering business outcomes through analytics. Communication: Exceptional communication skills, both written and verbal, with the ability to explain complex data and technical concepts to non-technical stakeholders. Certifications: PMP (Project Management Professional), Scrum Master, or any other relevant certifications in project management or data analytics is highly desirable. Preferred: Experience with cloud platforms (AWS, Azure, Google Cloud) and big data tools is a plus. Skills: hadoop,big data tools,scrum,risk management,sql,spark,team handling,agile,stakeholder communication,project management,data engineering,python,data analytics,cloud platforms"
        },
        {
            "company": "Marx Enterprise Transformation Architecture",
            "jobTitle": "Delivery Program Manager",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4177105502/",
            "jobLocation": "India (Remote)",
            "resumeGenerated": true,
            "jobDesc": "About the job Overview: We are seeking an experienced Delivery Program Manager to oversee and drive the successful delivery of Data and AI programs. This role requires a combination of strategic vision, technical knowledge, and exceptional program management skills. You will work closely with cross-functional teams, stakeholders, and customers to ensure our Data and AI initiatives meet business objectives, deadlines, and budgets while delivering measurable value. Responsibilities: Candidate should own end to end delivery of medium to large Data and AI programs, from planning to execution and closure. Candidate should be a people manager in terms of collaborating among Customer team, onsite and India teams Develop and define a structure and operating model for the program. Take accountability for project success including on time, on budget, high quality targets Candidate should lead from front in solving problems being faced by team and exhibit technical, analytical, and logical thinking. Should Implement and monitor delivery frameworks and best practices for Data and AI projects Candidate should own and track routine managerial tasks of his/her program from resource planning/hiring, transitioning, coaching/mentoring, reporting Candidate should be fluent with communication, presentation and interpersonal skills. Collaborate with Data Scientists, AI Engineers, Solution Architects and Customers to ensure technical feasibility and adherence to standards. Research best practices and use continuous process improvement disciplines to achieve results. Oversee the integration of data pipelines, AI models, and analytics solutions into operational environments. Candidate should be able to support Delivery head with margin improvement initiatives Be ready to travel, meet/greet customers as required Deal ownership during the presales stages, responsible for opportunity qualification to contracting to delivering agreed commitments Manage, monitor and mitigate project risks through the risk management plan, provide high level advice to the Project Managers in relation to risks and interdependencies, and contribute to monthly project reporting on progress, cost, quality, safety and environment issues to inform and support decision making Promote Agile practices to enhance team performance and adaptability. Leverage Agile tools and ceremonies, such as Scrum, Kanban, and retrospectives, to optimize delivery. Stay informed about industry trends in Data and AI to influence program strategies. Qualifications: Bachelor's degree in computer science, Data Science, Engineering, Business, or a related field. 12+ years of experience in program or project management, with a focus on Data and AI. Proven track record of delivering complex technology programs on time and within budget. Strong knowledge of data engineering, AI/ML concepts, and cloud platforms preferably in GCP Exceptional communication, negotiation, and stakeholder management skills. Proficiency in project management tools such as MS Project, JIRA, or equivalent. Experience with Agile methodologies and frameworks (e.g., Scrum, SAFe, or Kanban). Hands-on experience in Data and AI technologies, including data warehousing, machine learning, and analytics platforms. Familiarity with regulatory and compliance considerations in Data and AI (e.g., GDPR, AI Ethics)."
        },
        {
            "company": "Coinbase",
            "jobTitle": "Manager, Machine Learning",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4181095664/",
            "jobLocation": "India (Remote)",
            "resumeGenerated": true,
            "jobDesc": "About the job Ready to be pushed beyond what you think you’re capable of? At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system. To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems. Our work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be. The mission of the Platform Product Group engineers is to build a trusted, scalable and compliant platform to operate with speed, efficiency and quality. Our teams build and maintain the platforms critical to the existence of Coinbase. There are many teams that make up this group which include Product Foundations (i.e. Identity, Payment, Risk, Proofing & Regulatory, Finhub), Machine Learning, Customer Experience, and Infrastructure. The ML India team at Coinbase, specializes in leveraging AI's language capabilities for innovative products and solutions. As the industry buzzes with excitement over the widespread use of LLMs across various domains, within Coinbase, our focus is on crafting a multi-cloud LLM platform catering to every customer and employee. For our vast customer base 100M+, we develop LLM-powered experiences such as Customer Support Chatbots and Predictive Solutions, facilitating swift identification and resolution of customer issues. Meanwhile, for our workforce of 3500+ employees, we empower them with a self-serve platform to create AI assistants and tailored tool integrations, enhancing daily productivity. This groundbreaking solution relies on cutting-edge Large Language Models (LLMs), delivering human-like, domain-compliant, secure, and personalized generative responses to customer and employee queries. To realize our ambitious vision, we actively seek a highly skilled ML Engineering Manager. This role entails leading a team to scale up these capabilities, with a focus on platformization and harnessing state-of-the-art LLMs and tools. The aim is to seamlessly integrate and widely adopt these innovative solutions, ensuring they have the maximum impact. What you’ll be doing (ie. job duties): Hands-on with coding along with leading a team of ICs Plan and Implement the multi-year strategy for Machine Learning Language team with the technical leadership on your team Coach your direct reports to have a positive impact on the organization and chart a fulfilling career path. Be a thoughtful technical voice and support your team in making diligent architectural decisions. Collaborate with engineers, product managers and senior leadership to turn our vision into a tangible roadmap every quarter. Work with our talent organization to source and hire amazing engineers who will expand the Coinbase culture and product. Add positive energy in every meeting, and make your coworkers feel included in every interaction. Contribute to owning and delivering processes to drive engineering quality and meet our engineering SLAs. Navigate the team through high uncertainties such as: Dynamic product charters to cater to rapidly changing crypto-landscape Crypto bear /bull cycles (volatile stock prices, FUD etc.) Delivering top quality products in a very tight timeframe Manage a wide variety of stakeholders within the company to deliver ML-based solutions to best suit their needs. What we look for in you (ie. job requirements): At least 10 years of experience in software engineering. At least 2 years of engineering management experience. Comfortable managing engineers working across ML and backend technologies You have designed, built, and scaled production ML applications and very hands-on in leading a team of highly competent engineers You know what high quality code — and software engineering processes — look like and know how to foster an environment that creates them. You’re passionate about building an open financial system that brings the world together. Nice to haves: BS, MS, PhD degree in Computer Science, Machine Learning, Data Mining, Statistics, or related technical field. Knowledge of Apache Airflow, Spark, FjobLink, Kafka/Kinesis, Snowflake, Hadoop, Hive. Experience with Python. Experience with model interpretability, responsible AI. Experience with data analysis and visualization.PID - P54686 Please be advised that each candidate may submit a maximum of four applications within any 30-day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase's roles before applying. Commitment to Equal Opportunity Coinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view the Know Your Rights notice here. Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law. Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here). Global Data Privacy Notice for Job Candidates and Applicants Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here."
        },
        {
            "company": "Antal International",
            "jobTitle": "Senior Software Engineering Manager",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4179399440/",
            "jobLocation": "Pune, Maharashtra, India (On-site)",
            "resumeGenerated": true,
            "jobDesc": "About the job Senior Manager, Engineering - Software Architecture and Cloud Support Location: Pune Role Overview: My Client is a leading global product organisation based in the US, and have a state-of-the-art engineering center in Pune. They are looking for a Senior Manager of Architecture and Cloud Support, who will build, lead and manage a high-performance team focused on software architecture, cloud platform engineering, and DevOps enablement. You will be responsible for designing and scaling next-generation product architectures, managing cloud infrastructure, and implementing best practices in DevSecOps and CI/CD pipelines. This role involves driving architectural decisions, operational excellence, and cloud platform standardization, ensuring efficient, scalable, and secure product ecosystems across the organization. Key Responsibilities: Build, Lead and manage the Architecture and Cloud Support teams, including Software Architects, Solution Architects, Cloud Platform Engineers, and DevOps Engineers. Drive architectural design for next-generation products, ensuring scalability, security, and performance. Oversee the cloud platform and DevOps operations, ensuring best practices in cloud infrastructure, automation, and CI/CD pipelines. Define and enforce cloud platform standards, DevSecOps practices, and architecture governance across product groups. Build, scale, and mentor a high-performing, cross-functional team, focusing on continuous improvement and alignment with business goals. Collaborate with global teams to align architecture and infrastructure strategies with evolving business needs. Key Qualifications & Skills: 15+ years of experience in technical leadership roles in Software Architecture or Engineering teams, with a proven track record in cloud infrastructure and software architecture. Extensive experience managing technical teams and mentoring engineers. Extensive hands-on experience with cloud technologies, particularly AWS, CI/CD, DevSecOps, and automation. Strong experience in managing scalable distributed systems in cloud environments and virtualization technologies. Proven expertise in defining and implementing architecture standards and cloud platform operations. Excellent leadership, communication, and project management skills, with the ability to prioritize and deliver results in a dynamic environment. Global exposure, with experience managing teams and technical operations across different geographies. If you're passionate about driving architecture and cloud platform innovations while leading high-performing teams, this is your opportunity to make a significant impact in a fast-paced, growing environment. Write to me at Athira.Gopinathan@antal.com and I shall connect with you to discuss this exiciting opportunity!"
        },
        {
            "company": "GSPANN Technologies, Inc",
            "jobTitle": "Director - Technology (eCommerce Platform)",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4181024321/",
            "jobLocation": "Pune, Maharashtra, India (On-site)",
            "resumeGenerated": false,
            "jobDesc": "About the job About Company: GSPANN is a US California Bay Area-based consulting services provider focused on implementations in Enterprise Content Management, Business Intelligence & Mobile Solution initiatives. More than 90% of our current clientele are FORTUNE 1000 organizations. We specialize in strategy, architecture, delivery, and support of solutions in the ECM, BI, and Mobility space. Job Position: Director - Technology (eCommerce Platform) Experience: 16+ Years Location: Pune Role and Responsibilities: We are looking for an energetic and talented engineering director to lead the teams development, drive high-value, high-quality features to our industry-leading engineering delivery. The ideal candidate would have the ability to attract, recruit and retain the industry's best engineering talent and have the technical expertise to effectively influence/participate in architectural discussions, strategic planning, roadmaps, and decisions to ensure we build impactful, compelling, and scalable solutions in an incremental fashion, unlocking hyper-growth, data-driven decision making and creating a world of possibilities for our customers/business at our Technology Center in Pune, India. Leadership and Delivery: Oversee and lead the engineering project delivery for the ECommerce Global Multi-Tenant Platform, ensuring high availability, scalability, and performance to support global business operations. Cross-Functional Collaboration: Actively collaborate with Product Management, Business Stakeholders, and other Engineering Teams to define project requirements and deliver customer-centric solutions. Talent Acquisition and Development: Build a strong and diverse engineering team by attracting, recruiting, and retaining top talent. Develop and execute a continuous education program to upskill team members on both key technologies and business domain. Performance Management: Define clear, measurable goals for individual contributors and teams, ensuring alignment with broader organizational objectives. Manage performance reviews and recognize high-performing individuals, while providing coaching and support to those needing improvement. Technology Leadership: Champion the adoption of best practices in software engineering, including agile methodologies, DevOps, and automation. Facilitate and encourage knowledge sharing and expertise in critical technologies, such as cloud computing, microservices, and AI/ML. Resource Planning and Execution: Accurately estimate development efforts for projects, considering complexity, risks, and resource availability. Develop and implement delivery plans, timelines, and budgets to deliver initiatives on schedule. Oversee system rollouts and implementation efforts, ensuring smooth transitions and minimal disruptions to business operations. Organizational Improvement: Champion initiatives to improve the engineering organization’s culture, focusing on collaboration, transparency, and inclusivity. Continuously evaluate and refine engineering processes to increase efficiency and reduce bottlenecks. Lead efforts to make the organization a \"Great Place to Work\", including regular engagement activities, mentorship programs, and open communication. System Understanding and Technical Oversight: Develop a deep understanding of critical systems and processes, including architecture, APIs, data pipelines, and DevOps practices. Provide technical guidance to the team, addressing complex challenges and ensuring alignment with architectural best practices. Partner with senior leaders to align technology decisions with business priorities and future-proof the company’s systems. Innovation and Transformation: Play a pivotal role in transforming into a leading technology organization by implementing cutting-edge solutions in eCommerce, Platform Engineering, AI, ML, and Data Science. Required Experience and Expertise: Execution and Results Orientation Proven track record in developing and executing detailed plans, managing budgets, and delivering results under tight deadlines. Demonstrated ability to handle complex, fast-paced projects with competing priorities. Vendor and Stakeholder Management Skilled in negotiating and managing vendor relationships, contracts, and service-level agreements (SLAs). Core Technical Criteria: Bachelor’s degree in Computer Science, Engineering, or a related field. Equivalent work experience will also be considered. Expertise in Java frameworks such as Spring & Spring Boot, In-depth understanding of RESTful API design, implementation, and optimization. Knowledge of microservices architecture and tools like Kubernetes, Docker, and API Gateway. Experience in building scalable, high-performance backend systems to handle high traffic. Proficiency in tuning Java Virtual Machine (JVM) for optimal performance. Hands-on experience with relational databases like Oracle, MySQL, PostgreSQL, and NoSQL databases like MongoDB, Cassandra, or Redis. Ability to optimize database queries and manage large datasets effectively. Deep understanding of Vue.js components, Vuex (state management), Vue Router, and the ecosystem. Ability to optimize frontend code for performance, SEO, and user experience. Modern Web Development: Familiarity with JavaScript (ES6+), TypeScript, and tools like Webpack, Vite, or Rollup. In-depth knowledge of eCommerce security standards, including PCI DSS compliance for payment processing. Experience in implementing security best practices, such as authentication (OAuth2, SSO), encryption, and secure API design. Proven experience in designing and delivering eCommerce platforms that are scalable, reliable, and fault-tolerant. Ability to guide the team in code reviews, setting coding standards, and adopting best practices in Java and Vue.js development. Hands-on experience in mentoring and growing engineering talent, specifically for eCommerce-focused teams. Ability to collaborate with Product Managers and UX/UI Designers to align technical implementation with business goals and user experience. Experience in leading discussions on frontend performance optimization, UX responsiveness, and accessibility (WCAG standards). Why choose GSPANN “We GSPANNians” are at the heart of the technology that we pioneer. We do not service our customers, we co-create. With the passion to explore solutions to the most challenging business problems, we support and mentor the technologist in everyone who is a part of our team. This translates into innovations that are path-breaking and inspirational for the marquee clients, we co-create a digital future with. GSPANN is a work environment where you are constantly encouraged to sharpen your abilities and shape your growth path, We support you to become the best version of yourself by feeding your curiosity, providing a nurturing environment, and giving ample opportunities to take ownership, experiment, learn and succeed. We’re a close-knit family of more than 1400 people that supports one another and celebrates successes, big or small. We work together, socialize together, and actively serve the communities we live in. We invite you to carry forward the baton of innovation in technology with us. At GSPANN, we do not service. We Co-create. Discover your inner technologist - Explore and expand the boundaries of tech innovation without the fear of failure. Accelerate your learning - Shape your career while scripting the future of tech. Seize the ample learning opportunities to grow at a rapid pace Feel included - At GSPANN, everyone is welcome. Age, gender, culture, and nationality do not matter here, what matters is YOU Inspire and Be Inspired - When you work with the experts, you raise your game. At GSPANN, you’re in the company of marquee clients and extremely talented colleagues Enjoy Life - We love to celebrate milestones and victories, big or small. Ever so often, we come together as one large GSPANN family Give Back - Together, we serve communities. We take steps, small and large so we can do good for the environment, weaving in sustainability and social change in our endeavors We invite you to carry forward the baton of innovation in technology with us. Let’s Co-create."
        },
        {
            "company": "Seventh Contact Hiring Solutions",
            "jobTitle": "Engineering Manager- Java with New Zealand based product company,Koregoan Park, Pune.",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4181027320/",
            "jobLocation": "Pune, Maharashtra, India (Hybrid)",
            "resumeGenerated": false,
            "jobDesc": "About the job Job Summary - Job Overview: We are seeking an Engineering Manager to join our team. Roles & Responsibilities- ● Leading a team of 10-12 members. Guide and lead the development efforts of the team. Needs to be involved in the development process along with the team. ● To coordinate, design and facilitate the implementation of projects in an efficient and cost-effective manner. Responsible for the overall objectives of project delivery attaining scope, quality, budget, and timeline. ● Responsible for the overall accomplishment of assigned projects including planning and scheduling project activities ● Establishing and resourcing project roles and responsibilities o Defining tasks required for successful delivery to project milestones. ● Monitoring and reporting on quality and progress ● Accountable for ensuring the overall objectives of projects on scope, budget and timeline. ● Develops, implements and maintains sound project management and operational practices. ● Sole responsibility for “coaching” and “driving” the client and project team throughout the project life cycle. ● Building and maintaining project team spirit and motivation. ● Setting standards and expectations of team member performance. ● Developing work methods to craft team function and cohesiveness. ● Ensure training needs of the team are met. ● Reporting on budgets and forecasting figures including revenue margins, staff utilisation and project status. ● Supports the sales team in responding to bids/tenders. ● Ensuring that improvements made in projects make it back to the pre- sale process to ensure we are efficiently leveraging our learning from ongoing projects. ● Contributing as a senior member of Professional Services team in the achievement of excellence in all areas of Service Delivery ● Carry out other Project Management (internal or customer facing) duties as reasonably requested by your manager Required Qualifications- ● Candidate should be from Java Background ● Experience in Java 8, Spring, Spring boot. ● Experience building distributed systems, and micro services. ● Must have worked in Agile. ● Should have a minimum 2 years of experience working as manager. ● Techno-Managerial experience must have. ● Experience in Service Delivery ● Must have managed teams of at least 15-18 people (People management/ Team management) ● Experience with stakeholder management. ● Experience with strategic planning. ● Good knowledge and experience in relation to project management practices, tools and methodologies ● Experience in the Utilities domain will be an added advantage. ● Cloud native development experience would be a plus. Selection Process- Technical round 1 Techno managerial round 2 HR discussion"
        },
        {
            "company": "Taglynk ",
            "jobTitle": "Director of Engineering - Data Focused",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4175520116/",
            "jobLocation": "India (Remote)",
            "resumeGenerated": false,
            "jobDesc": "About the job About the Role: As the Director of Engineering , you will play a pivotal role in shaping our technology landscape and driving the next phase of growth for our provider data management platform. This position requires a hands-on leader who can establish engineering best practices, ensure high-quality software delivery, and build a scalable, resilient, and high-performance infrastructure. What You'll Do Lead a significant part of the engineering team: Establish best practices, design, and implement product capabilities and platform architecture to build a scalable, performant, and available provider data management platform. Ensure timely deliveries with high quality: Identify initiatives, design solutions, ensure teams are able to deliver, and drive comprehensive test coverage, Enhance Observability: Build and manage monitoring and observability frameworks, including logging and alerting systems, to improve system resilience. Cross-functional Collaboration: Partner with product and engineering teams to support scalable, high-quality releases and ensure smooth operations across development. Leadership & Mentorship: Lead a multi-disciplinary engineering team, promoting skill development and fostering a high-performance culture. Strategic Influence: Contribute to broader technical strategy, supporting our mission to build a robust, scalable, and enterprise-ready platform. What Makes You a Match? (Must have) Experience: 14+ years in software engineering roles, and 5+ years in management including some experience managing other managers. Enterprise software delivery with high quality and performance. SaaS enterprise software development and delivery. Experience working on data-related software, Master Data Management experience is preferred over other data areas. Infrastructure as Code: Proficiency in Terraform, CloudFormation, or similar tools. Containerization & Orchestration: Skilled in Docker, Kubernetes, and scalable cloud infrastructure. Experience building observability into enterprise software (preferred tools include GCP Logging, Stackdriver, GCP tracing) Leadership Qualities: High initiative, collaborative, and able to align technical improvements with business goals, able to organize multiple teams and lead other leaders in the organization. Communication Skills: Able to articulate complex technical concepts effectively to diverse stakeholders."
        },
        {
            "company": "Redis",
            "jobTitle": "Manager, Technical Account Management",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4177604562/",
            "jobLocation": "India (Remote)",
            "resumeGenerated": false,
            "jobDesc": "About the job Who We Are We're Redis. We built the product that runs the fast apps our world runs on. (If you checked the weather, used your credit card, or looked at your flight status online today, you’re welcome.) At Redis, you’ll work with the fastest, simplest technology in the business—whether you’re building it, telling its story, or selling it to our 10,000+ worldwide customers. We’re creating a faster world with simpler experiences. You in? Job Title: Manager - Technical Account Manager (TAM) Location: Bangalore, India About Redis Redis is the driving force behind real-time data processing, empowering businesses to build, deploy, and scale modern applications with unparalleled speed and efficiency. As a trusted partner for enterprises worldwide, Redis delivers cutting-edge database solutions that transform how companies manage and optimize their data workloads. Role Overview We are seeking an experienced Technical Account Manager (TAM) Leader to establish and lead our Technical Account Management function in India. This is a critical, high-impact role where you will build and manage a team of 3-4 Technical Account Managers (TAMs) in Bangalore. Your team will provide proactive, strategic guidance to enterprise customers who have purchased Redis’ enterprise support services, ensuring they successfully adopt, consume, and renew their subscriptions. This is a newly created role in our organization, offering a unique opportunity to define the strategy and execution of technical account management in the region. The success of this team will be measured primarily by Net Revenue Retention (NRR), with a core focus on customer retention. Key Responsibilities Build and Lead a High-Performing Team: Recruit, onboard, and mentor a team of top-tier Technical Account Managers (TAMs) in India. Customer Success & Adoption: Drive adoption and full consumption of Redis solutions by ensuring customers understand best practices, architectural guidance, and proactive engagement strategies. Account Management: Each TAM will manage a portfolio of 10-20 enterprise customers, building long-term relationships and helping them maximize their investment in Redis. Renewal & Expansion: Focus on customer renewals by driving value realization. Any identified upsell opportunities will be logged and passed to the sales team for follow-up. Proactive Technical Guidance: Provide customers with strategic insights, operational best practices, and proactive risk mitigation—this is not a support role (we have a separate support team), but your team will offer technical advisory and guidance. Cross-Functional Collaboration: Work closely with Sales, Support, Engineering, and Product teams to ensure customers receive a seamless experience and have a direct line to Redis experts when needed. Metrics-Driven Execution: Define and monitor key performance indicators (KPIs), including NRR, customer retention rates, adoption milestones, and TAM performance metrics. Required Qualifications Proven Leadership Experience: 5+ years in a leadership role managing customer-facing technical teams, preferably in a Technical Account Management, Customer Success, or Solutions Engineering capacity. Technical Expertise: Strong background in Linux, application development, or DevOps. A deep understanding of distributed systems, databases, or cloud infrastructure is a plus. Customer-Centric Approach: Track record of driving customer engagement, proactive problem-solving, and building lasting relationships with enterprise clients. Operational Excellence: Experience in scaling TAM functions, defining best practices, and implementing processes that enhance customer outcomes. Strategic Thinking: Ability to balance short-term tactical needs with long-term strategic initiatives that drive customer retention and value. Strong Communication Skills: Ability to articulate complex technical concepts to both technical and business stakeholders effectively. Preferred Qualifications Experience working in a fast-growing SaaS, PaaS, or database company. Familiarity with Redis or other NoSQL/SQL databases. Background in DevOps, cloud computing, or software development lifecycle methodologies. Why Join Redis? Be a founding leader for the Technical Account Management team in India, shaping the strategy and impact of the function from the ground up. Work with some of the largest enterprise customers in the world, helping them optimize their use of Redis solutions. Join a company that is at the forefront of real-time data processing and next-generation database technology. Competitive compensation, equity opportunities, and career growth in a high-growth global company. If you are passionate about leading technical teams, driving customer success, and shaping the future of Redis in India, we want to hear from you! As a global company, we value a culture of curiosity, diversity of thought, and innovation from our employees, customers, and partners. Redis is committed to a diverse and inclusive work environment where all employees’ differences are celebrated and supported, and everyone feels safe to bring their authentic selves to work. Redis is dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national orientation, sexual orientation, age, marital status, disability, gender identity, gender expression, Veteran status, or any other classification protected by federal, state, or local law. We strive to create a workplace where every voice is heard, and every idea is respected. Redis is committed to working with and providing access and reasonable accommodation to applicants with mental and/or physical disabilities. If you think you may require accommodations for any part of the recruitment process, please send a request to recruiting@redis.com. All requests for accommodations are treated discreetly and confidentially, as practical and permitted by law. Redis reserves the right to retain data longer than stated in the privacy policy in order to evaluate candidates."
        },
        {
            "company": "EPAM Systems",
            "jobTitle": "Technical Delivery Manager - Java",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4172655924/",
            "jobLocation": "Pune, Maharashtra, India (On-site)",
            "resumeGenerated": false,
            "jobDesc": "About the job We are seeking a Technical Delivery Manager with a strong emphasis on Java to oversee our delivery and project management initiatives. In this role, you will be responsible for managing the digital refresh and MACH replatform project for a Canadian automotive retailer. You will establish frameworks for project initiation and guide technical teams through the technology selection process. The ideal candidate will have a rich background in project management, particularly in managing end-to-end project lifecycles. If you are passionate about cultivating relationships with clients and delivering consistent value, we would love to hear from you! Responsibilities Manage the delivery of the digital refresh and MACH replatform project Establish a solid framework, roles, and communication for project initiation Guide technical teams in the selection of technology stack or platforms Coordinate with technical teams to ensure quality engineering output Cultivate relationships with customers to understand their needs Work closely with 3-5 teammates and engage with third-party vendors Ensure project deliverables are on time and within budget Requirements Minimum of 10 years’ experience in Java software development Strong understanding of MACH architecture and Microservice Architecture Style Proven experience with Spring Boot and CI/CD processes Solid knowledge of Agile processes and project management methodologies Experience in product development from end-to-end or mid-cycle Good understanding of engineering practices and coding best practices Proficient in test automation strategies and practices Excellent people management and team leadership skills Strong client communication and negotiation skills Fluent in English with strong verbal and written communication skills Nice to have Familiarity with E-commerce and mobile development projects Experience with sandbox strategy and CI/CD design Ability to engage effectively with technical teams Strong analytical and problem-solving skills Excellent interpersonal skills and team collaboration abilities"
        },
        {
            "company": "MindTrilogy",
            "jobTitle": "AWS AI Data Engineer",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4179399885/",
            "jobLocation": "India (Remote)",
            "resumeGenerated": false,
            "jobDesc": "About the job AWS AI Data Engineer Contract: 6 months Budget: 100LPM Freelance Remote Role Scope / Deliverables* We are looking for an experienced AWS AI Data Engineer to join our dynamic team, responsible for developing, managing, and optimizing data architectures that support AI and Machine Learning (ML) workflows. The ideal candidate will have extensive experience in integrating large-scale datasets, building scalable and automated data pipelines, and working with advanced ML frameworks and tools. The candidate should also have experience with AWS ETL services (such as AWS Glue, Lambda, and Data Pipeline) to handle data processing and integration tasks effectively. Must Have Skills* 1. Proficiency in programming languages such as Python, Scala, or similar. 2. Solid understanding of machine learning frameworks such as TensorFlow and PyTorch. 3. Strong experience in data classification, including the identification of PII data entities. 4. Knowledge and experience with retrieval-augmented generation (RAG) and agent based workflows. 5. Deep understanding of how-to re-rank and improve LLM outputs using Index and Vector stores. 6. Ability to leverage AWS services (e.g., SageMaker, Comprehend, Entity Resolution) to solve complex data and AI-related challenges. 7. Ability to manage and deploy machine learning models and frameworks at scale using AWS infrastructure. 8. Strong analytical and problem-solving skills, with the ability to innovate and develop new approaches to data engineering and AI/ML. 9. experience with AWS ETL services (such as AWS Glue, Lambda, and Data Pipeline) to handle data processing and integration tasks effectively. 10. Experience in core AWS Services including AWS IAM, VPC, EC2, S3, RDS, Lambda, CloudWatch, CloudTrail. Nice to Have skills: 1. Experience with data privacy and compliance requirements, especially related to PII data. 2. Familiarity with advanced data indexing techniques, vector databases, and other technologies that improve the quality of AI/ML outputs."
        },
        {
            "company": "VARAISYS PVT. LTD.",
            "jobTitle": "Technical Program Manager – Data Analytics",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4175029997/",
            "jobLocation": "Pune, Maharashtra, India (On-site)",
            "resumeGenerated": false,
            "jobDesc": "Responsibilities Project Management: Lead and manage the full lifecycle of technical data analytics projects, ensuring adherence to project scope, quality, timelines, and budget constraints. Cross-functional Coordination: Work closely with engineering, data science, product management, business intelligence, and quality assurance teams to deliver seamless execution of data analytics programs. Risk Management: Proactively identify, assess, and mitigate risks related to data integrity, project timelines, and technical challenges to ensure project success. Data Strategy Alignment: Ensure alignment of technical initiatives with business goals and data strategies, translating business needs into actionable technical solutions. Resource Allocation: Manage resources, including personnel, technology, and budget, effectively to maximize efficiency and project outcomes. Performance Monitoring: Utilize project management and data tracking tools to monitor progress, provide reports on key metrics, and ensure programs meet predefined objectives and timelines. Stakeholder Communication: Provide regular, transparent communication to stakeholders regarding project status, risks, and potential delays, ensuring alignment with overall business objectives. Continuous Improvement: Identify areas for process improvement and drive initiatives to enhance the overall efficiency, quality, and delivery of data analytics programs. Skills And Qualifications Experience: 10+ years of experience in managing technical programs, with a strong background in data analytics, data engineering, or related fields. Technical Expertise: In-depth understanding of data analytics methodologies, tools, and technologies (e.g., Hadoop, Spark, SQL, Python), as well as software development methodologies (e.g., Agile, Scrum). Leadership: Proven ability to lead cross-functional teams, inspire collaboration, and motivate teams to achieve project goals in a fast-paced environment. Analytical Skills: Strong analytical and problem-solving abilities, with a focus on data-driven decision-making and delivering business outcomes through analytics. Communication: Exceptional communication skills, both written and verbal, with the ability to explain complex data and technical concepts to non-technical stakeholders. Certifications: PMP (Project Management Professional), Scrum Master, or any other relevant certifications in project management or data analytics is highly desirable. Preferred: Experience with cloud platforms (AWS, Azure, Google Cloud) and big data tools is a plus."
        },
        {
            "company": "Marx Enterprise Transformation Architecture",
            "jobTitle": "Delivery Program Manager",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4177105502/",
            "jobLocation": "India (Remote)",
            "resumeGenerated": false,
            "jobDesc": "Responsibilities: Candidate should own end to end delivery of medium to large Data and AI programs, from planning to execution and closure. Candidate should be a people manager in terms of collaborating among Customer team, onsite and India teams Develop and define a structure and operating model for the program. Take accountability for project success including on time, on budget, high quality targets Candidate should lead from front in solving problems being faced by team and exhibit technical, analytical, and logical thinking. Should Implement and monitor delivery frameworks and best practices for Data and AI projects Candidate should own and track routine managerial tasks of his/her program from resource planning/hiring, transitioning, coaching/mentoring, reporting Candidate should be fluent with communication, presentation and interpersonal skills. Collaborate with Data Scientists, AI Engineers, Solution Architects and Customers to ensure technical feasibility and adherence to standards. Research best practices and use continuous process improvement disciplines to achieve results. Oversee the integration of data pipelines, AI models, and analytics solutions into operational environments. Candidate should be able to support Delivery head with margin improvement initiatives Be ready to travel, meet/greet customers as required Deal ownership during the presales stages, responsible for opportunity qualification to contracting to delivering agreed commitments Manage, monitor and mitigate project risks through the risk management plan, provide high level advice to the Project Managers in relation to risks and interdependencies, and contribute to monthly project reporting on progress, cost, quality, safety and environment issues to inform and support decision making Promote Agile practices to enhance team performance and adaptability. Leverage Agile tools and ceremonies, such as Scrum, Kanban, and retrospectives, to optimize delivery. Stay informed about industry trends in Data and AI to influence program strategies. Qualifications: Bachelor's degree in computer science, Data Science, Engineering, Business, or a related field. 12+ years of experience in program or project management, with a focus on Data and AI. Proven track record of delivering complex technology programs on time and within budget. Strong knowledge of data engineering, AI/ML concepts, and cloud platforms preferably in GCP Exceptional communication, negotiation, and stakeholder management skills. Proficiency in project management tools such as MS Project, JIRA, or equivalent. Experience with Agile methodologies and frameworks (e.g., Scrum, SAFe, or Kanban). Hands-on experience in Data and AI technologies, including data warehousing, machine learning, and analytics platforms. Familiarity with regulatory and compliance considerations in Data and AI (e.g., GDPR, AI Ethics)."
        },
        {
            "company": "micro1",
            "jobTitle": "Senior Technical Project Manager",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4181020387",
            "jobLocation": "REmote",
            "resumeGenerated": false,
            "jobDesc": "Job Summary: We are seeking a highly skilled Senior Technical Project Manager with deep technical expertise and a proven ability to lead engineering teams in building iOS applications. This role requires full ownership of planning, scope management, and sprint execution, ensuring aggressive deadlines are met while maintaining technical excellence. Key Responsibilities: Lead and manage engineering teams to develop, deploy, and scale iOS applications. Oversee and run agile engineering sprints, ensuring timely delivery of milestones. Define, plan, and track project scope, timelines, and deliverables with a strong focus on execution. Drive technical discussions and collaborate with engineers to resolve blockers. Ensure quality assurance, performance optimization, and best engineering practices. Own the end-to-end development cycle, from planning to production release. Work closely with stakeholders, designers, and developers to align on priorities and goals. Identify risks, dependencies, and develop mitigation plans to keep the project on track. Required Qualifications: Deep technical knowledge in mobile application development (iOS preferred). Proven track record of delivering engineering milestones for a production-level app. Strong experience with agile methodologies, sprint planning, and execution. Excellent leadership, organizational, and problem-solving skills. Ability to work in a fast-paced environment with aggressive deadlines. Strong communication skills to align cross-functional teams. Nice to have: Experience in building social apps with scalable architecture. Experience in building AI-powered applications, particularly with recommendation systems. Familiarity with cloud services, backend infrastructure, and mobile CI/CD pipelines."
        },
        {
            "company": "\nFinastra",
            "jobTitle": "Senior Project Manager",
            "jobLink": "https://www.jobLinkedin.com/jobs/view/4132940835",
            "jobLocation": "Pune, Maharashtra, India",
            "resumeGenerated": false,
            "jobDesc": "Responsibilities & Deliverables: Your deliverables as a [Senior Project Manager] will include, but are not limited to, the following: Interact with client, consultatively, to determine project requirements and needs analysis. Establish and/or assist client with configuring system parameters and controls based on client’s business practices and processes; recommend best practices; review setup with clients and gain client acceptance. Conduct data analysis and mapping activities for assigned applications if applicable. Analyze source data files and map data to target application for use by technical resources to develop programs. Provide on-site or remote support during client conversions as applicable. Establish and/or assist client with establishing system parameters and controls based on client’s business practices and processes, recommend best practices, review setup with clients, and gain client acceptance. Conduct data mapping activities for assigned applications if applicable. Analyze source data files and map data to target application for use by technical resources to develop programs. Test and troubleshoot system configuration and functionality. Validate new system input, output, and connectivity. Identify, research, and assist in resolving any issues with technical resources. Facilitate converted database validation work sessions with clients as applicable. Assess and report risks during project and participate in the development and implementation of mitigation plans. Communicate project scope, status, and risks to all stakeholders. Record accurate and timely accounting of time spent on project related activities. Follow established project, departmental, company procedures and quality standards. Follow established project management standards. Provide activities related to the management of assigned implementation projects to bring the project to a timely close and transition the client appropriately. Complete post-implementation tasks in a timely manner. Update internal documentation as applicable. Provide subject matter expertise to internal staff including, but not limited to, sales, development, support, training, professional services as needed. Participate in the development of implementation or training content. Conduct software training and/or reinforce prior training to both external clients and internal staff. Maintain, enhance, and broaden knowledge and skills of software applications and industry practices. Required Experience: Minimum of 9+ years of experience in relevant area of expertise, preferably for a financial institution or an industry software company. Client facing service experience required. Software implementation, support, or training experience strongly preferred. Experience with project management disciplines preferred. Experience with Finastra products a plus."
        },
        {
            "company": "Addepar",
            "jobTitle": "Staff Engineer",
            "jobLink": "",
            "jobLocation": "Pune, India",
            "resumeGenerated": true,
            "jobDesc": "Addepar is building solutions to support our clients' alternatives investment strategies. We’re using AI to automate and streamline ingestion and analysis of alternatives investment data. We're hiring a Senior Software Engineer to design, implement and deliver these ground breaking software solutions. You will collaborate closely with cross-functional teams including data scientists and product managers to build intuitive solutions that revolutionize how clients experience AI and ML in the application and transform their experience of alternatives operations. You will work closely with data scientists on document based workflow automation and peer engineering teams to define the tech stack. You will iterate quickly through cycles of testing a new product offering on Addepar. If you've crafted scalable systems, or worked with phenomenal teams on hard problems in financial data, or are just interested in solving really hard technical, critically important problems, come join us! What You’ll Do • Design, build and iterate on web based applications for alternatives data professionals Build responsive UIs that enable PDF annotations, tagging and navigation. • Implement and maintain engineering solutions by writing well-designed, testable code. • Lead individual project priorities, achievements, and software releases. • Collaborate with machine learning engineers to bring ML models into the backend stack of the application in Python or other languages. • Collaborate with product managers and client teams on product requirements iterations, design feasibility and user feedback. • Document software functionality, system design, and project plans; this includes clean, readable code with comments. • Learn and promote engineering standard methodologies and principles. Who You Are • Minimum 9+ years of experience in software engineering • Proficient with Python or similar OOP'S Language • Experience with streaming data platforms and event driven architecture • Ability to write software to process, aggregate, and compute on top of large amounts of data in an efficient way. • Engage with all levels of collaborators on a technical level. • A strong ownership mentality and strive to take on the most important problems. • Experience with AWS or any public cloud is a strong plus. • Knowledge of front end development a plus. • Experience working with SaaS companies will be nice to have. • Experience with Terraform, Docker, Kubernetes will be highly preferred."
        }
    ]
}