{
    "jobDescription": [
        {
            "company": "K-Quest Junction LLP",
            "jobTitle": "Vice President delivery Operations",
            "jobLink": "foundit.in",
            "jobLocation": "Pune",
            "resumeGenerated": false,
            "jobDesc": "This role is responsible for leading an account with high complexity involving managed services, large program delivery, represent us and deal with CXO/SVP of the client organization. Also accountable for delivery excellence, customer delight, and employee satisfaction within the account and responsible for grooming competency in line with customer roadmap.\n\nResponsibilities and Duties :\n\nResponsible for planning and delivery - quality compliance, resource economic utilization and customer satisfaction.\nResponsible for relationship building with customer project managers and key stakeholders within the account and responsible for customer satisfaction.\nResponsible for people processes in the account, employee attrition rate, people and competency development and engagement.\nCollaborate and interact with client engagement managers, program/project managers from various internal teams and Client side.\nOwnership of Managed Services Operations, SLAs/KPIs, Collaboration within Applications & Infrastructure teams, People management.\nWork with Project and Technology team to plan releases to augment customer experience and optimizing processes.\nIdentify process gaps and help plug them by simplification of the process- Producing accurate and timely reporting of program status throughout its life cycle.\nBusiness Direction and Strategy: Strategic Thinking, Business Acumen and Commercial Thinking, Effective Decision Making, Entrepreneurial Mindset, Systems Thinking and Negotiation and Influence\nDesired Candidate Profile\nFundamental project management skills\nProject management tools & techniques such as Wrike, Atlassian Jira, MS Project etc.\nExcellent client-facing and internal communication skills\nWorked in an agile environment\nWorking knowledge of SDLC and Architecture\nUnderstanding of the latest and upcoming technology developments\n10+ years of experience\nEnterprise Portfolio Management\nLeading and managing teams in multiple technologies\nIn-depth understanding and experience of the SDLC\nPrevious in-depth experience with upselling and key account management\nB. Tech / MCA is the minimum eligibility criteria\nPreferred\nLeading and managing teams across multiple locations\n\nPMP / Lean Sigma / Prince II Certification"
        },
        {
            "company": "HSBC",
            "jobTitle": "Technical Project Delivery /Delivery Head",
            "jobLink": "foundit.in",
            "jobLocation": "Pune,India",
            "resumeGenerated": false,
            "jobDesc": "We are currently seeking an experienced professional to join our team in the role of a Delivery Head\n\nIn this role, you will:\n\nDrives delivery and supports the Product Owner (PO) in day-to-day planning and in assuring timely and planned delivery of product. Also, own the product roadmap alongside PO.\nFacilitate planning sessions and complies with the HSBC Agile Framework e.g. Scrum, Kanban, LEAN, SAFe.\nEnsures Business value is delivered across technical deliveries which are prioritised as per roadmapalongside business deliveries.\nIn addition, ensure technical debt is not accumulated comprised when delivering new business capabilities.\nResponsible for managing risks and issues with PO/DL to unblock and mitigate risks.\nRegularly participates and drives innovation at asset class level and at organisational initiatives.\nProvideTimely and accurate project updates as agreed with the project steering committee.\nRepresent project team and accurate provide accurate project updates in all relevant forums.\nAnswer project related questions at a reasonable level of technical and functional depth.\nHighlight Risks and facilitate their mitigation.\nMaintain, update and track RAID log.\nCollaborates and promotes team culture by being :\nInclusive of others\nSharings and listening.\nSupporting efforts of others.\nMotivating others to adopt change and do the right thing.\n18years of experience and above required\nRequirements\nTo be successful in this role, you should meet the following requirements:\n\nAgile/Scrum Development Experience\nProject Management/Stakeholder Management/Project Planning\nJava, Micro Services, Spring Boot\nDevOps, CICD\nAgile Tools (Jira, Confluence),\nDisciplined approach to requirements analysis with a software engineering or computer science background (either at degree level or working for a software company)\nHighly proficient in working in an agile way with a high empathy for continuous delivery and incremental business outcome driven - must be able to orchestrate smaller business driven outcomes for improving cadence.\nCommunication Skills - A good listener, very effective communicator.\nAlways strives to continue to learn and persuade others to continue to learn as well\nEnsures Business value is delivered across technical deliveries which are prioritised as per roadmap\nDocumentation: Shall be able to articulate subject in a crisp and effective documentation\nCollaboration: Shall be well equipped with collaboration tools\nProblem solver\nStructured worker able to efficiently manage multiple tasks.\nYou'll achieve more when you join HSBC.\n\nwww.hsbc.com/careers\n\nHSBC is committed to building a culture where all employees are valued, respected and opinions count. We take pride in providing a workplace that fosters continuous professional development, flexible working and opportunities to grow within an inclusive and diverse environment. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement, which is available on our website."
        }
    ]
}